---
kind: property
id: P:Autodesk.Revit.Exceptions.ApplicationException.FunctionId
source: html/84bd650f-9f87-dccb-4dd4-b23ca890b8b9.htm
---
# Autodesk.Revit.Exceptions.ApplicationException.FunctionId Property

The information of the function throwing the exception.

## Syntax (C#)
```csharp
public FunctionId FunctionId { get; }
```